In [1]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

In [19]:
df = pd.read_excel('FIFA WORLD CUP.xlsx')
pr = pd.read_excel('Predict.xlsx')

In [ ]:
df['WORTH (€)'] = df['WORTH (€)'].str.replace('M', '')
df['WORTH (€)'] = df['WORTH (€)'].astype(float)

In [22]:
df

,GROUP,COUNTRY,NO.,NAME,POSITION,HEIGHT,WORTH (€),BIRTH,AGE,CLUB,...,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,FIFA HIGHEST LEVEL
0,A,QATAR,1,Saad Al Sheeb,GK,185,0.200,1990.02.19,32,Al-Sadd,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,90.0
1,A,QATAR,21,Yousef Hassan,GK,186,0.150,1996.05.24,26,Al-Gharafa,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,65.0
2,A,QATAR,22,Meshaal Barsham,GK,178,0.450,1998.02.14,24,Al-Sadd,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,65.0
3,A,QATAR,2,Ró-Ró,DF,182,0.325,1990.08.06,32,Al-Sadd,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,69.0
4,A,QATAR,4,Mohammed Waad,DF,183,0.400,1999.09.18,23,Al-Sadd,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,65.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
825,H,Uruguay,9,Luis Suárez,FW,182,4.000,1987.01.24,35,Nacional,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,98.0
826,H,Uruguay,11,Darwin Núñez,FW,187,70.000,1999.06.24,23,Liverpool,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,98.0
827,H,Uruguay,18,Maxi Gómez,FW,186,7.500,1996.08.14,26,Trabzonspor,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,100.0
828,H,Uruguay,20,Facundo Torres,FW,177,8.000,2000.04.13,22,Orlando City SC,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,73.0
829,H,Uruguay,21,Edinson Cavani,FW,184,5.000,1987.02.14,35,Valencia,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,99.0

In [23]:
multi = df[['COUNTRY', 'HEIGHT' , 'WORTH (€)' ,'AGE' , 'INTERNATIONAL MATCHES' , 'PREVIOUS　GOALS']]
multi.head()

  COUNTRY  HEIGHT  WORTH (€)  AGE  INTERNATIONAL MATCHES  PREVIOUS　GOALS
0   QATAR     185      0.200   32                     80               0
1   QATAR     186      0.150   26                      9               0
2   QATAR     178      0.450   24                     15               0
3   QATAR     182      0.325   32                     78               1
4   QATAR     183      0.400   23                     20               0

In [24]:
multi.groupby('COUNTRY').mean().head()

,HEIGHT,WORTH (€),AGE,INTERNATIONAL MATCHES,PREVIOUS GOALS
COUNTRY,,,,,
Argentina,178.769231,24.700000,27.769231,35.307692,6.461538
Australia,181.038462,1.434615,27.153846,21.961538,2.115385
Belgium,185.153846,21.661538,27.807692,53.384615,9.538462
Brazil,180.730769,43.923077,27.884615,37.307692,6.269231
Cameroon,181.807692,5.961538,26.307692,26.807692,3.384615

In [25]:
standard = pr[['Year' , 'Height' , 'Worth', 'Age' , 'International Matches' , 'Goals']]

In [11]:
imr = SimpleImputer(missing_values=np.nan, strategy ='mean')
new_standard = imr.fit_transform(standard)
new_standard = pd.DataFrame(new_standard)
new_standard.columns= ['Year' , 'Height' , 'Worth', 'Age' , 'International Matches' , 'Goals']
height = standard['Height'].mean()
worth = standard['Worth'].mean()
age = standard['Age'].mean()
goals = standard['Goals'].mean()
df = pd.DataFrame(data = [[height, worth, age, goals]],
    columns = ['Height' , 'Worth', 'Age', 'Goals'])
#最終基準
df

       Height      Worth        Age     Goals
0  181.177778  28.923913  26.875556  8.917808

In [12]:
def seq(x,y,z):

   x=x-z
   sequence=pd.DataFrame(data=x,index=y,columns=['error'])
   sequence.insert(1,'scores',sequence.rank(ascending=True))
     
   return sequence

In [13]:

def cal_rel(x, y):
    rel = abs(x-y)
    return rel

In [49]:
def create_df(a, b): 
    data = {
        "diff" : a,
        "score" : b
    }
    df = pd.DataFrame(data)
    df.index = ["Croatia", "Argentina", "Morocco", "France"]
    df.columns = ["difference", "score"]
    print(df)

In [15]:
def cal_total(x, y ,z ,q):
    total = x*0.25+y*0.25+z*0.25+q*0.25
    return total

In [54]:
def winner(a, b): 
    data = {
        "total" : a,
        "rank" : b
    }
    df = pd.DataFrame(data)
    df.index = ["Croatia", "Argentina", "Morocco", "France"]
    df.columns = ["total score", "rank"]
    print(df)
    winner = df.index[(df['rank'] == 1)].tolist()
    print("The winner is", winner[0])

In [18]:
df.head()

       Height      Worth        Age     Goals
0  181.177778  28.923913  26.875556  8.917808

In [26]:
dfPortugal = df[df['COUNTRY'] == 'Portugal']
dfEngland = df[df['COUNTRY'] == 'England']
dfFrance = df[df['COUNTRY'] == 'France']
dfMorocco = df[df['COUNTRY'] == 'Morocco']
dfNetherlands = df[df['COUNTRY'] == 'Netherlands']
dfArgentina = df[df['COUNTRY'] == 'Argentina']
dfCroatia = df[df['COUNTRY'] == 'Croatia']
dfBrazil = df[df['COUNTRY'] == 'Brazil']

In [28]:
C_amean = dfCroatia['AGE'].mean()
C_hmean = dfCroatia['HEIGHT'].mean()
C_age = cal_rel(C_amean, age)
C_height = cal_rel(C_hmean, height)

B_amean = dfBrazil['AGE'].mean()
B_hmean = dfBrazil['HEIGHT'].mean()
B_age = cal_rel(B_amean, age)
B_height = cal_rel(B_hmean, height)

N_amean = dfNetherlands['AGE'].mean()
N_hmean = dfNetherlands['HEIGHT'].mean()
N_age = cal_rel(N_amean, age)
N_height = cal_rel(N_hmean, height)

A_amean = dfArgentina['AGE'].mean()
A_hmean = dfArgentina['HEIGHT'].mean()
A_age = cal_rel(A_amean, age)
A_height = cal_rel(A_hmean, height)

M_amean = dfMorocco['AGE'].mean()
M_hmean = dfMorocco['HEIGHT'].mean()
M_age = cal_rel(M_amean, age)
M_height = cal_rel(M_hmean, height)

P_amean = dfPortugal['AGE'].mean()
P_hmean = dfPortugal['HEIGHT'].mean()
P_age = cal_rel(P_amean, age)
P_height = cal_rel(P_hmean, height)

E_amean = dfEngland['AGE'].mean()
E_hmean = dfEngland['HEIGHT'].mean()
E_age = cal_rel(E_amean, age)
E_height = cal_rel(E_hmean, height)

F_amean = dfFrance['AGE'].mean()
F_hmean = dfFrance['HEIGHT'].mean()
F_age = cal_rel(F_amean, age)
F_height = cal_rel(F_hmean, height)

In [38]:
S=[dfCroatia['PREVIOUS　GOALS'].mean(), dfArgentina['PREVIOUS　GOALS'].mean(), dfMorocco['PREVIOUS　GOALS'].mean(), dfFrance['PREVIOUS　GOALS'].mean()]
W=[dfCroatia['WORTH (€)'].mean(), dfArgentina['WORTH (€)'].mean(),dfMorocco ['WORTH (€)'].mean(), dfFrance ['WORTH (€)'].mean()]
C=['Croatia', 'Argentina', 'Morocco', 'France']

In [39]:
g_score=seq(S,C,goals)['scores']
g_score=g_score.reset_index(drop=True)
seq(S,C,goals)

              error  scores
Croatia   -3.956270     2.0
Argentina -2.456270     4.0
Morocco   -5.917808     1.0
France    -2.997808     3.0

In [40]:
w_score=seq(W,C,worth)['scores']
w_score=w_score.reset_index(drop=True)
seq(W,C,worth)

               error  scores
Croatia   -14.423913     2.0
Argentina  -4.223913     3.0
Morocco   -19.650836     1.0
France     10.976087     4.0

In [50]:
AGE = pd.Series([M_age, F_age, A_age, C_age])
a_score = AGE.rank(ascending = False)
create_df(AGE, a_score)
# a_score

           difference  score
Croatia      0.683248    2.0
Argentina    0.635556    3.0
Morocco      0.893675    1.0
France       0.509060    4.0

In [51]:
HEIGHT = pd.Series([C_height, A_height, M_height, F_height])
h_score = HEIGHT.rank(ascending = False)
create_df(HEIGHT, h_score)

           difference  score
Croatia      3.322222    2.0
Argentina    2.408547    4.0
Morocco      2.629915    3.0
France       4.342222    1.0

In [52]:
total = cal_total(a_score, h_score, w_score, g_score)
t_score = total.rank(ascending=False)
total

0    2.0
1    3.5
2    1.5
3    3.0
dtype: float64

In [55]:
winner(total, t_score)

           total score  rank
Croatia            2.0   3.0
Argentina          3.5   1.0
Morocco            1.5   4.0
France             3.0   2.0
The winner is Argentina